# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

a = int(input('Введите число'))
a = chr(a + 96)
print(a)
