"""
1. Пользователь вводит данные о количестве предприятий, их наименования и
прибыль за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия..
Программа должна определить среднюю прибыль (за год для всех предприятий) и
вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.
"""
# Дмитрий, возвращаясь к доделыванию less4 я не выполнил git add и commit в less5.
# В результате в less5 все потеряно. Сегодня повторить уже не успею - форсмажер.
# Написать все заново сегодня уже не смогу. Прошу дать возможность исправиться